#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/tech-challenge-fase-3-iac/runs/run-sa6ge3ZL1rRWNxVD

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
module.eks.module.kms.data.aws_partition.current: Refreshing...
module.lanchonete_vpc.aws_vpc.this: Refreshing state... [id=vpc-0645c9ed43e0cc037]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/lanchonete-eks-cluster/cluster]
module.eks.data.aws_partition.current: Refreshing...
module.nat_gateway.aws_eip.this: Refreshing state... [id=eipalloc-0a9a23f69386f177b]
data.aws_iam_role.lab_role: Refreshing...
module.lanchonete_http_api.aws_apigatewayv2_api.this: Refreshing state... [id=yedv13j998]
module.eks.module.kms.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Refreshing...
module.eks.data.aws_caller_identity.current: Refreshing...
module.eks.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Refresh complete after 0s [id=721525683170]
module.eks.data.aws_caller_identity.current: Refresh complete after 0s [id=721525683170]
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
module.eks.module.eks_managed_node_group["labs"].data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["labs"].data.aws_partition.current: Refreshing...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refreshing...
module.eks.module.eks_managed_node_group["labs"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refresh complete after 0s [id=427788031]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=377835ee-9d06-42c0-ba5f-607db3445a65]
module.eks.module.eks_managed_node_group["labs"].data.aws_caller_identity.current: Refresh complete after 0s [id=721525683170]
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Refreshing state... [id=$default]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/lanchonete-eks-cluster]
module.lanchonete_eks_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-00cdaea04bcd24663]
module.internet_gateway.aws_internet_gateway.this: Refreshing state... [id=igw-0dec75d5a2b87d0fc]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0539ac03272fef687]
module.lanchonete_private_rt.aws_route_table.this: Refreshing state... [id=rtb-0fa33b8351f836483]
module.lanchonete_public_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-02a0f8dabc2d10ba2]
module.lanchonete_rds_sg.aws_security_group.this: Refreshing state... [id=sg-0aa69a58b786edd83]
module.lanchonete_eks_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-0d93c1ccd28f5b4f8]
module.lanchonete_public_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-00e6a8d16157269d2]
module.lanchonete_public_rt.aws_route_table.this: Refreshing state... [id=rtb-0d730d2f61e4efd38]
module.lanchonete_db_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-07806e23613eab91e]
module.lanchonete_db_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-001642fcf43e1b09c]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-00b361e21ca946330]
aws_route.lanchonete_public_inet_route: Refreshing state... [id=r-rtb-0d730d2f61e4efd381080289494]
aws_route_table_association.eks_private_rtb: Refreshing state... [id=rtbassoc-0a62843e52c65893a]
aws_route_table_association.lanchonete_public_rtb: Refreshing state... [id=rtbassoc-07aefaac025219fff]
aws_route_table_association.lanchonete_private_rta_db_a: Refreshing state... [id=rtbassoc-059e78af905003a87]
aws_route_table_association.lanchonete_public_rta: Refreshing state... [id=rtbassoc-0b46221734bc81da6]
module.nat_gateway.aws_nat_gateway.this: Refreshing state... [id=nat-044fc4d63aeff711d]
aws_route_table_association.eks_private_rta: Refreshing state... [id=rtbassoc-0447fa69f3dfd5669]
module.lanchonete_http_api.aws_apigatewayv2_vpc_link.this: Refreshing state... [id=ebxfqq]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1249962833]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-531686292]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3107848129]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3837092548]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3718040586]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1711664176]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1089126699]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-50734103]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-4112412422]
aws_route.lanchonete_private_inet_route: Refreshing state... [id=r-rtb-0fa33b8351f8364831080289494]
aws_route_table_association.lanchonete_private_rtb_db_b: Refreshing state... [id=rtbassoc-0ea0f0f1ad66b5b62]
module.lanchonete_rds.aws_db_subnet_group.this: Refreshing state... [id=lanchonete-subnet-group]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=lanchonete-eks-cluster]
module.eks.aws_security_group.node[0]: Drift detected (update)
module.eks.aws_security_group.cluster[0]: Drift detected (update)
module.eks.aws_eks_cluster.this[0]: Drift detected (update)
module.lanchonete_private_rt.aws_route_table.this: Drift detected (update)
module.lanchonete_public_rt.aws_route_table.this: Drift detected (update)
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Drift detected (update)
module.lanchonete_http_api.aws_apigatewayv2_vpc_link.this: Drift detected (update)
module.lanchonete_http_api.aws_apigatewayv2_api.this: Drift detected (update)
module.nat_gateway.aws_eip.this: Drift detected (update)
module.nat_gateway.aws_nat_gateway.this: Drift detected (update)
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["vpc-cni"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["coredns"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["eks-pod-identity-agent"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_eks_addon.this["kube-proxy"],
│   on .terraform/modules/eks/main.tf line 380, in resource "aws_eks_addon" "this":
│  380:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
      + arn                           = "arn:aws:eks:us-east-1:721525683170:cluster/lanchonete-eks-cluster"
      + certificate_authority         = [
          + {
                # (1 unchanged attribute hidden)
            },
        ]
      + endpoint                      = "https://5913B344122E88065FCB1274D3F70147.gr7.us-east-1.eks.amazonaws.com"
        id                            = "lanchonete-eks-cluster"
      + identity                      = []
        name                          = "lanchonete-eks-cluster"
      + platform_version              = "eks.15"
      + status                        = "CREATING"
        tags                          = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.db_password_secret.aws_secretsmanager_secret.this will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = true
      + id                             = (known after apply)
      + name                           = "lanchonete-db-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "Provisioner" = "Terraform"
        }
      + tags_all                       = {
          + "Provisioner" = "Terraform"
        }

      + replica (known after apply)
    }

  # module.db_password_secret.aws_secretsmanager_secret_version.this will be created
  + resource "aws_secretsmanager_secret_version" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "eks-pod-identity-agent"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/lanchonete-eks-cluster/cluster"
        name              = "/aws/eks/lanchonete-eks-cluster/cluster"
      ~ tags              = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all          = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Provisioner"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Provisioner"
      + resource_id = (known after apply)
      + value       = "Terraform"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "eks-pod-identity-agent"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "lanchonete-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Provisioner" = "Terraform"
        }
      + tags_all             = {
          + "Provisioner" = "Terraform"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                           = "arn:aws:eks:us-east-1:721525683170:cluster/lanchonete-eks-cluster" -> (known after apply)
      ~ certificate_authority         = [
          - {
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2024-12-16T22:15:30Z" -> (known after apply)
      ~ endpoint                      = "https://5913B344122E88065FCB1274D3F70147.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "lanchonete-eks-cluster" -> (known after apply)
      ~ identity                      = [] -> (known after apply)
        name                          = "lanchonete-eks-cluster"
      ~ platform_version              = "eks.15" -> (known after apply)
      ~ status                        = "CREATING" -> (known after apply)
      ~ tags                          = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all                      = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
        # (4 unchanged attributes hidden)

      ~ access_config (known after apply)
      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
          + service_ipv6_cidr = (known after apply)

          ~ elastic_load_balancing (known after apply)
          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      ~ upgrade_policy (known after apply)
      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          + cluster_security_group_id = (known after apply)
          ~ vpc_id                    = "vpc-0645c9ed43e0cc037" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_security_group.cluster[0] will be updated in-place
  ~ resource "aws_security_group" "cluster" {
        id                     = "sg-00b361e21ca946330"
        name                   = "lanchonete-eks-cluster-cluster-20241216221515536000000005"
      ~ tags                   = {
          - "Environment" = "dev" -> null
            "Name"        = "lanchonete-eks-cluster-cluster"
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all               = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] will be updated in-place
  ~ resource "aws_security_group" "node" {
        id                     = "sg-0539ac03272fef687"
        name                   = "lanchonete-eks-cluster-node-20241216221515536200000006"
      ~ tags                   = {
          - "Environment"                                  = "dev" -> null
            "Name"                                         = "lanchonete-eks-cluster-node"
          + "Provisioner"                                  = "Terraform"
          - "Terraform"                                    = "true" -> null
            "kubernetes.io/cluster/lanchonete-eks-cluster" = "owned"
        }
      ~ tags_all               = {
          - "Environment"                                  = "dev" -> null
          + "Provisioner"                                  = "Terraform"
          - "Terraform"                                    = "true" -> null
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.lanchonete_rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "lanchonete-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "lanchonete"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name"        = "lanchonete-rds"
          + "Provisioner" = "Terraform"
        }
      + tags_all                              = {
          + "Name"        = "lanchonete-rds"
          + "Provisioner" = "Terraform"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0aa69a58b786edd83",
        ]
    }

  # module.eks.module.eks_managed_node_group["labs"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "lanchonete-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "labs-"
      + node_role_arn          = "arn:aws:iam::721525683170:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00cdaea04bcd24663",
          + "subnet-0d93c1ccd28f5b4f8",
        ]
      + tags                   = {
          + "Name"        = "labs"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Name"        = "labs"
          + "Provisioner" = "Terraform"
        }
      + version                = "1.31"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["labs"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for labs EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "labs-"
      + tags                   = {
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Provisioner" = "Terraform"
        }
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-0539ac03272fef687",
        ]
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"        = "labs"
              + "Provisioner" = "Terraform"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"        = "labs"
              + "Provisioner" = "Terraform"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"        = "labs"
              + "Provisioner" = "Terraform"
            }
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "377835ee-9d06-42c0-ba5f-607db3445a65"
      ~ tags                               = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all                           = {
          - "Environment" = "dev" -> null
          + "Provisioner" = "Terraform"
          - "Terraform"   = "true" -> null
        }
        # (13 unchanged attributes hidden)
    }

Plan: 11 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  + lanchonete_rds_endpoint          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*